# Среди целых чисел, принадлежащих числовому отрезку [326496; 649632],
# найдите числа, у которых количество четных делителей равно количеству нечетных делителей.
# При этом в каждой из таких групп делителей не менее 70 элементов.
# Для каждого найденного числа запишите само число и минимальный делитель, больший 1000.

def devided(n):
    a = set()
    for i in range(1, int(n ** 0.5) + 1):
        if n % i == 0:
            a.add(i)
            a.add(n // i)
    return a


for i in range(326496,649632+1):
    a = devided(i)
    neh = [x for x in a if x % 2 == 0 ]
    h = [x for x in a if x % 2 != 0]
    if len(neh) == len(h) and len(h) >= 70:
        print(i, min([x for x in a if x > 1000]))