#Среди натуральных чисел, не превышающих 106, найдите все числа, соответствующие маске 12*45*
# и делящиеся на число 51 без остатка.
# В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания,
# а во втором столбце — соответствующие им частные от деления на 51.


import fnmatch

for i in range(51, 10**6,51):
    if fnmatch.fnmatch(str(i),"12*45*"):
        print(i,i//51)